01  WS-AREA-1 PIC 9(5) VALUE 99999.
01  WS-AREA-2 PIC 9(5) VALUE 12345.
01  WS-AREA-3 PIC 9(10). 

ADD WS-AREA-1 TO WS-AREA-2 GIVING WS-AREA-3.
DISPLAY "Result: " WS-AREA-3.